ariplayz/WifiKiwi/firmware/sdkconfig.defaults
# WifiKiwi default sdkconfig overrides.
# Target: ESP32-C5 (RISC-V) with 8 MB flash + 8 MB PSRAM (WROOM-1U-N8R8).

CONFIG_IDF_TARGET="esp32c5"

# Flash & partitioning
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM (8 MB Quad)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# Wi-Fi 6 dual-band (2.4 + 5 GHz)
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_11AX_SUPPORT=y
CONFIG_ESP_WIFI_DUAL_BAND_SUPPORT=y
CONFIG_ESP_WIFI_COUNTRY_DEFAULT_IFTMX=y

# BLE 5.3
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_BLE_50_FEATURES_SUPPORTED=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# FreeRTOS tick at 1 kHz for snappy LVGL
CONFIG_FREERTOS_HZ=1000

# Stack sizes (LVGL + Wi-Fi monitor want headroom)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
